/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */

public class Main {
    public static void main(String[] args) {
        int number = 25;
        //напишите тут ваш код
        int mult = number*number;
        System.out.println("квадрат: "+mult);


    }
}
